advanced/frontend/models/Aula.php

    public function getAlunosInscritos($idAula) {
        $presencaMM = new Presenca();
        $listaPresencas = $presencaMM->findAll([
            'Aula_idAula' => $idAula,
        ]);
---
SELECT * FROM `presenca` WHERE `Aula_idAula`='1'

    public function getAlunosPresentes() {
        $presenca = new Presenca();
        $alunosPresentes = $presenca->findAll([
            'Aula_idAula' => Yii::$app->getRequest()->getQueryParam('idAula'),
            'Presente' => 1
        ]);
---
SELECT * FROM `presenca` WHERE (`Aula_idAula`='1') AND (`Presente`=1)