advanced/frontend/models/AulaSearch.php

    public function search($params)
    {

        $idUser = Yii::$app->user->getId();
        $tipoUtilizador = Yii::$app->user->identity->TipoUtilizador;
        if($tipoUtilizador == 'T'){
            //COISAS DO TREINADOR
            $utilizadorLogado = Treinador::find()->where(['Id_User' => $idUser])->one();
//            $aulas_turma = Turma::find()->where(['Treinador_idTreinador' => $utilizadorLogado->idTreinador])->all();
            $query = Aula::find();
//                ->from(['aula', 'turma'])
//                ->where(['Treinador_idTreinador' => $utilizadorLogado->idTreinador]);
            $subQuery1 = Turma::find();
            $query->leftJoin(['turmas' => $subQuery1], 'turmas.Aula_idAula = idAula')
                ->where(['Treinador_idTreinador' => $utilizadorLogado->idTreinador]);

            $subQuery2 = Presenca::find()->select('Aula_idAula, COUNT(Estado)=1 as nr_presentes');
            $query->leftJoin(['presentes' => $subQuery2], 'presentes.Aula_idAula = idAula');
        }else if($tipoUtilizador == 'A'){
            //COISAS DO ALUNO
            $utilizadorLogado = Aluno::find()->where(['Id_User' => $idUser])->one();
---
SELECT * FROM `treinador` WHERE `Id_User`=2
SELECT * FROM `aluno` WHERE `Id_User`=10