advanced/frontend/models/PresencaSearch.php

    public function procurarPresencaPorIDAula($idAula)
    {
        $aula = Aula::findOne($idAula);
        $presenca = Presenca::findOne($aula->aulaIdAula);
---
SELECT * FROM `presenca` WHERE `Aula_idAula`='1'