advanced/frontend/models/Turma.php

SELECT * FROM `treinador` WHERE `Id_User`=2
---
    public function procurarTreinadorPorID($idTreinador)
    {
        $treinador = new Treinador();

        $idT = $treinador->findAll(
            ['Id_User' => $idTreinador]
        );