advanced/backend/controllers/AulaController.php

SELECT * FROM `aula`
---
    public function actionIndex()
    {
        $searchModel = new AulaSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        //$idUser = Yii::$app->user->getId();
        //$treinador = Treinador::find()->where(['Id_User' => $idUser])->one();

        //$aulas_turma = Turma::find()->where(['Treinador_idTreinador' => $treinador->idTreinador])->all();

        //$aulas = [];

        $aulas = Aula::find()->all();

INSERT INTO `presenca` (`Aluno_idAluno`, `Aula_idAula`) VALUES (1, 189)
---
                            $modelPresenca->Aluno_idAluno = $idAluno;
                            $modelPresenca->Aula_idAula = $model->idAula;

                            $modelPresenca->save();