advanced/backend/controllers/SiteController.php

    public function actionIndex()
    {

        $datasBD = Aluno::find();
        $datasSel = array();
        $datasSel = $datasBD->all();
---
SELECT * FROM `aluno`