advanced/frontend/controllers/AulaController.php

    public function actionIndex()
    {
        $searchModel = new AulaSearch();
        $dataProvider = $searchModel->search(Yii::$app->request->queryParams);

        $idUser = Yii::$app->user->getId();
        //TODO: verificar se user logado é treinador ou é aluno

        $tipoUtilizador = Yii::$app->user->identity->TipoUtilizador;
        if($tipoUtilizador == 'T'){
            //COISAS DO TREINADOR
            $utilizadorLogado = Treinador::find()->where(['Id_User' => $idUser])->one();
            $aulas_turma = Turma::find()->where(['Treinador_idTreinador' => $utilizadorLogado->idTreinador])->all();
        }else if($tipoUtilizador == 'A'){
            //COISAS DO ALUNO
            $utilizadorLogado = Aluno::find()->where(['Id_User' => $idUser])->one();
            $aulas_turma = Presenca::find()->where(['Aluno_idAluno' => $utilizadorLogado->idAluno])->all();
        }

        $aulas = [];

        foreach($aulas_turma as $index => $aula_turma){
            $aula = Aula::findOne($aula_turma->Aula_idAula);
---
SELECT * FROM `treinador` WHERE `Id_User`=2
SELECT * FROM `turma` WHERE `Treinador_idTreinador`=1
SELECT * FROM `aluno` WHERE `Id_User`=10
SELECT * FROM `presenca` WHERE `Aluno_idAluno`=2
SELECT * FROM `aula` WHERE `idAula`=16

    public function actionView($id)
    {
        $searchModelAluno = new AlunoSearch();
        $dataProvider = $searchModelAluno->search(Yii::$app->request->queryParams, $id);


        $aula = Aula::findOne($id);
        //$dataProvider = $aula->alunos; */

        $array =  $aula->getAlunosInscritos($aula->idAula);
        $dataProviderAluno = Aluno::find()->where(['not in','idAluno',$array])->all();
---
SELECT * FROM `aula` WHERE `idAula`='101'

    public function actionCreate()
    {
        $model = new Aula();

        $presencas = Yii::$app->request->post('Aula')['presencas'];

        $nomeAluno = substr($presencas['aluno'],0,strpos($presencas['aluno'],' - '));
        $contato = substr($presencas['aluno'],strpos($presencas['aluno'],' - ') + 3);
        $idAluno = Aluno::findOne(['Nome' => $nomeAluno, 'Contato1' => $contato])->idAluno;
        $alunos_adicionados = Yii::$app->request->post('Aula')['alunos_a_adicionar'];

            if(count($alunos_adicionados) > 0){

            if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `aula` (`Nome`, `HoraInicio`, `HoraFim`) VALUES ('Lixo', '2016-01-15 17:50', '2016-01-15 22:50')
INSERT INTO `presenca` (`Aluno_idAluno`, `Aula_idAula`) VALUES (1, 102)