advanced/frontend/controllers/PresencaController.php

    protected function findModel($idPresenca, $Aula_idAula)
    {
        if (($model = Presenca::findOne(['idPresenca' => $idPresenca, 'Aula_idAula' => $Aula_idAula])) !== null) {
---
SELECT * FROM `presenca` WHERE (`idPresenca`='1') AND (`Aula_idAula`='1')