advanced/frontend/controllers/PresencaController.php

SELECT * FROM `aula` WHERE `idAula`='0'
SELECT * FROM `presenca` WHERE `Aula_idAula`=1
SELECT * FROM `aula` WHERE `idAula`='1'
---
    public function actionView($idAula)
    {
        $aula = Aula::findOne($idAula);

        //$listaAlunos = Yii::$app->request->post('aulas');
        $listaAlunos = $aula->alunos;

        $listaPresencas = $this->getPresencasPorIDAula($idAula);
        //vetor acociativo

      //  return \yii\helpers\Json::encode([$aula,$listaAlunos]);
        //$presencas = $aula->presencas;
/*        $listaAlunos = $this->getAlunosPorIDPresenca($idGetPresenca); */

        $variavel = 'Qualquer coisa';
      return $this->render('view', [
          'listaAlunos' => $listaAlunos,
          'listaPresencas' => $listaPresencas,
          'model' => $this->findModel($idAula , $idAula),
          //'idGetPresenca' => $idGetPresenca,
        ]);

SELECT * FROM `presenca` WHERE (`idPresenca`='0') AND (`Aula_idAula`='0')
---
    protected function findModel($idPresenca, $Aula_idAula)
    {
        if (($model = Presenca::findOne(['idPresenca' => $idPresenca, 'Aula_idAula' => $Aula_idAula])) !== null) {