advanced/backend/views/aula/_form2.php

SELECT * FROM `treinador`
---

            <?php

            $dataProviderTreinador = Treinador::find()->all();

SELECT * FROM `aluno`
---

        <?php

        $dataProviderAluno = Aluno::find()->all();