advanced/backend/models/Aluno.php

    public function getEscaloes()
    {
        $models = Escalao::find()->asArray()->all();
---
SELECT * FROM `escalao`